Repository: flini1we/T-TravelTogether
Catalog: TTravelTogether/Resources/*.lproj/Localizable.strings
Languages: ru

source: Change Theme
ru: Изменить тему

source: Updated Theme
ru: Тема обновлена

source: Clear Screen
ru: Очистить экран

source: Reminder
ru: Напоминание

# Для отправки уведомлений разрешите их в настройках
source: Please allow notifications in settings to send them
ru: Для отправки уведомлений разрешите их в настройках

# Имя не должно быть пустым
source: Name cannot be empty
ru: Имя не должно быть пустым

# Имя должно начинаться с загловной буквы
source: Name must start with a capital letter
ru: Имя должно начинаться с загловной буквы

# Имя содержит недопустимые символы
source: Name contains invalid characters
ru: Имя содержит недопустимые символы

# Фамилия не должна быть пустой
source: Last name cannot be empty
ru: Фамилия не должна быть пустой

# Фамилия должна начинаться с загловной буквы
source: Last name must start with a capital letter
ru: Фамилия должна начинаться с загловной буквы

# Фамилия содержит недопустимые символы
source: Last name contains invalid characters
ru: Фамилия содержит недопустимые символы

# Введите номер в формате 89... или +79...
source: Enter number in format 89... or +79...
ru: Введите номер в формате 89... или +79...

# Номер слишком длинный
source: Number is too long
ru: Номер слишком длинный

# Хотя бы 1 заглавная буква и 1 цифра
source: At least 1 capital letter and 1 number
ru: Хотя бы 1 заглавная буква и 1 цифра

# Слишком короткий пароль
source: Password is too short
ru: Слишком короткий пароль

# Слишком длинный пароль
source: Password is too long
ru: Слишком длинный пароль

# Пароли должны совпадать
source: Passwords must match
ru: Пароли должны совпадать

# Номер телефона
source: Phone Number
ru: Номер телефона

# Пароль
source: Password
ru: Пароль

# Повторите пароль
source: Confirm Password
ru: Повторите пароль

# Войти
source: Sign In
ru: Войти

# Регистрация
source: Registration
ru: Регистрация

# Зарегистрироваться
source: Register
ru: Зарегистрироваться

# Авторизация
source: Authorization
ru: Авторизация

# Имя
source: Name
ru: Имя

# Фамилия
source: Last Name
ru: Фамилия

# Ок
source: OK
ru: Ок

# Ошибка
source: Error
ru: Ошибка

# Подтвердить
source: Confirm
ru: Подтвердить

# Настройки
source: Settings
ru: Настройки

# Отмена
source: Cancel
ru: Отмена

# Доступ к списку контактов
source: Access to Contacts
ru: Доступ к списку контактов

# Пожалуйста предоставьте доступ к контактам для добавления в поездку
source: Please provide access to contacts to add them to the trip
ru: Пожалуйста предоставьте доступ к контактам для добавления в поездку

# Покинуть поездку
source: Leave Trip
ru: Покинуть поездку

# Удалить поездку
source: Delete Trip
ru: Удалить поездку

# Админ не может покинуть поездку.
source: Admin cannot leave the trip.
ru: Админ не может покинуть поездку.

# Вы уверены что хотете покинуть данное путешествие?
source: Are you sure you want to leave this trip?
ru: Вы уверены что хотете покинуть данное путешествие?

# Вы уверены что хотете удалить данное путешествие?
source: Are you sure you want to delete this trip?
ru: Вы уверены что хотете удалить данное путешествие?

# Только админ может редактировать поездку
source: Only admin can edit the trip
ru: Только админ может редактировать поездку

# Пользователь не найден
source: User not found
ru: Пользователь не найден

# Повторите попытку снова
source: Please try again
ru: Повторите попытку снова

# Некорректная стоимость поездки
source: Invalid trip cost
ru: Некорректная стоимость поездки

# История транзакций
source: Transaction History
ru: История транзакций

source: Transaction
ru: Транзакция

source: Something about current transaction
ru: Что-то о текущей транзакции

# Здесь будут ваши транзакции
source: Your transactions will appear here
ru: Здесь будут ваши транзакции

# Выберите категорию
source: Select category
ru: Выберите категорию

# Добавьте описание к транзакции
source: Add description to transaction
ru: Добавьте описание к транзакции

# Введите стоимость
source: Enter cost
ru: Введите стоимость

# Заплатить
source: Pay
ru: Заплатить

# Сумма
source: Amount
ru: Сумма

# Создать
source: Create
ru: Создать

# Описание транзакции не может быть пустым
source: Transaction description cannot be empty
ru: Описание транзакции не может быть пустым

# Цена транзакции должна быть числом
source: Transaction price must be a number
ru: Цена транзакции должна быть числом

source: When selecting "Split between participants" option, the sum of debts must equal the transaction amount
ru: При выборе опции "Сплит между участниками" сумма долгов должна быть равна сумме транзакции

# Детали транзакции
source: Transaction Details
ru: Детали транзакции

# Данные о долгах
source: Debt Information
ru: Данные о долгах

# Оплатит свой долг
source: Will pay their debt
ru: Оплатит свой долг

# Создатель транзакции
source: Transaction Creator
ru: Создатель транзакции

# Оплатить долг
source: Pay Debt
ru: Оплатить долг

# Напомнить о долге
source: Remind about Debt
ru: Напомнить о долге

# Удалить транзакцию может только ее создатель
source: Only the creator can delete the transaction
ru: Удалить транзакцию может только ее создатель

# Редактировать транзакцию может только ее создатель
source: Only the creator can edit the transaction
ru: Редактировать транзакцию может только ее создатель

# Вы уверены что хотите удалить транзакцию?
source: Are you sure you want to delete the transaction?
ru: Вы уверены что хотите удалить транзакцию?

# Действие невозможно будет отменить. Данные очистятся
source: This action cannot be undone. Data will be cleared
ru: Действие невозможно будет отменить. Данные очистятся

# Транзакции не сущесвует. Попробуйте снова позже
source: Transaction does not exist. Please try again later
ru: Транзакции не сущесвует. Попробуйте снова позже

# Сохранить
source: Save
ru: Сохранить

# Ошибка. Редактируемой транзакции не существует, попробуйте повторить похже
source: Error. The transaction being edited does not exist, please try again later
ru: Ошибка. Редактируемой транзакции не существует, попробуйте повторить похже

# Неизвестная ошибка
source: Unknown error
ru: Неизвестная ошибка

# Ошибка регистрации
source: Registration error
ru: Ошибка регистрации

# Ошибка при раскодировании токенов
source: Error decoding tokens
ru: Ошибка при раскодировании токенов

# Доступ ограничен, перейдите к регистрации
source: Access restricted, please proceed to registration
ru: Доступ ограничен, перейдите к регистрации

# Доступ ограничен, попробуйте еще раз
source: Access restricted, please try again
ru: Доступ ограничен, попробуйте еще раз

# Данные о датах поездки отстуствуют.
source: Trip date data is missing.
ru: Данные о датах поездки отстуствуют.

# Доступ к реадктированию запрещен.
source: Editing access is prohibited.
ru: Доступ к реадктированию запрещен.

# Реадктируемая поездка не валидна.
source: The trip being edited is not valid.
ru: Реадктируемая поездка не валидна.

# Даты редактируемой поездки не валидны. Попробуйте снова позже
source: The dates of the trip being edited are not valid. Please try again later
ru: Даты редактируемой поездки не валидны. Попробуйте снова позже

# Ошибка в преобразовании данных. Попробуйте снова
source: Error converting data. Please try again
ru: Ошибка в преобразовании данных. Попробуйте снова

# Профиль
source: Profile
ru: Профиль

# Архив поездок
source: Trip Archive
ru: Архив поездок

# Сменить язык
source: Change Language
ru: Сменить язык

# Сменить тему
source: Change Theme
ru: Сменить тему

# Выйти из профиля
source: Sign Out
ru: Выйти из профиля
